export const rolesLable = [
  { value: '89898989-1234-8989-8989-898989898989', key: 'USER' },
  { value: '89898989-1235-8989-8989-898989898989', key: 'MARSHALL' },
  { value: '89898989-1236-8989-8989-898989898989', key: 'SUPERVISOR' },
  { value: '89898989-1237-8989-8989-898989898989', key: 'SENIOR_SUPERVISOR' },
  { value: '89898989-1238-8989-8989-898989898989', key: 'SUPER_ADMIN' },
  { value: '89898989-1239-8989-8989-898989898989', key: 'MAIN_USER' },
  { value: '89898989-1230-8989-8989-898989898989', key: 'SYSTEM_ADMIN' },
];

export const rolesDropDown = [
  {
    id: '89898989-1234-8989-8989-898989898989',
    name: { en: 'User', ar: 'مستخدم' },
  },
  {
    id: '89898989-1235-8989-8989-898989898989',
    name: { en: 'Marshall', ar: 'مارشال' },
  },
  {
    id: '89898989-1236-8989-8989-898989898989',
    name: { en: 'Supervisor', ar: 'مشرف' },
  },
  {
    id: '89898989-1237-8989-8989-898989898989',
    name: { en: 'Senior Supervisor', ar: 'مشرف سنوي' },
  },
  {
    id: '89898989-1238-8989-8989-898989898989',
    name: { en: 'Super Admin', ar: 'مدير عام' },
  },
  {
    id: '89898989-1239-8989-8989-898989898989',
    name: { en: 'Main User', ar: 'مستخدم رئيسي' },
  },
  {
    id: '89898989-1230-8989-8989-898989898989',
    name: { en: 'System Admin', ar: 'مدير النظام' },
  },
];
export const rolesBinding = {
  '89898989-1234-8989-8989-898989898989': 'USER',
  '89898989-1235-8989-8989-898989898989': 'MARSHALL',
  '89898989-1236-8989-8989-898989898989': 'SUPERVISOR',
  '89898989-1237-8989-8989-898989898989': 'SENIOR_SUPERVISOR',
  '89898989-1238-8989-8989-898989898989': 'SUPER_ADMIN',
  '89898989-1239-8989-8989-898989898989': 'MAIN_USER',
  '89898989-1230-8989-8989-898989898989': 'SYSTEM_ADMIN',
};
